Repository: ossilator/masqmail
Catalog: debian/po/*.po
Languages: vi

source: Manage masqmail.conf using debconf?
vi: Cấu hình masqmail bằng debconf không?

source: The /etc/masqmail/masqmail.conf file can be handled automatically by debconf, or manually by you.
vi: Tập tin cấu hình « /etc/masqmail/masqmail.conf » có thể được quản lý một cách tự động bằng debconf, hoặc bằng tay của bạn.

source: Note that only specific, marked sections of the configuration file will be handled by debconf if you select this option; if those markers are absent, you will have to update the file manually, or move or delete the file.
vi: Ghi chú rằng chỉ những phần riêng có dấu của tập tin cấu hình đó sẽ được quản lý bằng debconf nếu bạn bật tùy chọn này. Nếu không có dấu đặc biệt, bạn sẽ cần phải tự cập nhật tập tin đó, hoặc di chuyển hoặc xoá nó.

source: Replace existing /etc/masqmail/masqmail.conf file?
vi: Thay thế tập tin « /etc/masqmail/masqmail.conf » tồn tại không?

source: The existing /etc/masqmail/masqmail.conf file currently on the system does not contain a marked section for debconf to write its data.
vi: Tập tin « /etc/masqmail/masqmail.conf » hiện thời nằm trên hệ thống không phải chứa phần có dấu gán nó cho debconf để ghi dữ liệu.

source: If you select this option, the existing configuration file will be backed up to /etc/masqmail/masqmail.conf.debconf-backup and a new file written to /etc/masqmail/masqmail.conf. If you do not select this option, the existing configuration file will not be managed by debconf, and no further questions about masqmail configuration will be asked.
vi: Nếu bạn bật tùy chọn này, tập tin cấu hình tồn tại sẽ được sao lưu vào « /etc/masqmail/masqmail.conf.debconf-backup », và một tập tin mới được ghi vào « /etc/masqmail/masqmail.conf ». Còn nếu bạn không bật tùy chọn này, tập tin cấu hình tồn tại sẽ không được quản lý bằng debconf, và không có câu hỏi thêm nữa sẽ được hỏi về cấu hình của masqmail.

source: Masqmail host name:
vi: Tên máy masqmail:

source: Please enter the name used by masqmail to identify itself to others. This is most likely your hostname. It is used in its SMTP greeting banner, for expanding unqualified addresses, the Message ID and so on.
vi: Hãy gõ tên được dùng bởi Masqmail để nhận diện nó cho phần mềm khác. Rất có thể là tên máy của bạn. Nó được dùng trên biểu ngữ chào mừng SMTP, để mở rộng các địa chỉ chưa hoàn toàn, trong « Message ID » (mã nhận diện thông điệp) v.v.

source: Hosts considered local:
vi: Các máy cục bộ :

source: Please enter a list of hosts, separated with semicolons (;), which are considered 'local', ie. mail to these hosts will be delivered to a mailbox (or Maildir or MDA) on this host.
vi: Hãy gõ danh sách các máy, định giới bằng dấu chấm phẩy, mà được xem là « cục bộ », tức là các thư được gửi cho máy này sẽ được phát cho hộp thư (hay Maildir hay MDA) trên máy này.

source: You will most likely insert 'localhost', your hostname in its fully qualified form and just the simple hostname here.
vi: Ở đây bạn rất có thể chèn « localhost » (máy cục bộ), tên máy của bạn có dạng đầy đủ, và chỉ tên máy đơn giản.

source: You can also use wildcard expressions like '*' and '?'.
vi: Cũng có khả năng sử dụng ký tự đại diện như « * » và « ? ».

source: Nets considered local:
vi: Các mạng cục bộ :

source: Please enter a list of hosts, separated with semicolons (;), which are on your local network, ie. they are always reachable, without a dialup connection. Mail to these hosts will be delivered immediately, without checking for the online status.
vi: Hãy gõ danh sách các máy, định giới bằng dấu chấm phẩy, mà nằm trên mạng cục bộ (LAN), tức là luôn luôn có thể tới chúng, không cần sự kết nối quay số. Các thư được gửi cho máy kiểu này sẽ được phát ngay tức khắc, không cần kiểm tra trạng thái trực tuyến.

source: You can use wildcards expressions like '*' and '?', eg. *.yournet.local
vi: Cũng có khả năng sử dụng ký tự đại diện như « * » và « ? », v.d. « *.mạng_bạn.local ».

source: If you have only one box, you can leave this empty. If you do not want to use masqmail as an offline MTA, and the whole internet or another mail server which accepts outgoing mail is at all times reachable to you, just insert '*'.
vi: Nếu bạn chỉ có một máy tính thì có thể bỏ trống. Nếu bạn không muốn sử dụng masqmail như là MTA ngoại tuyến, cũng luôn luôn có thể tới toàn bộ Mạng hay máy phục vụ thư tín khác mà chấp nhận các thư được gửi đi, chỉ hãy chèn dấu sao « * ».

source: Interfaces for incoming connections:
vi: Các giao diện nhận kết nối:

source: Masqmail, for security reasons, does not listen an all network interfaces by default. If there are no other hosts connected to your host, just leave the default 'localhost:25' value. If there are other hosts that may want to send SMTP messages to this host, add the address of your network interface here, eg.: localhost:25;192.168.1.2:25.
vi: Trình masqmail, vì lý do bảo mật, không lắng nghe trên mọi giao diện mạng theo mặc định. Nếu không có máy khác được kết nối đến máy của bạn, chỉ hãy để lại giá trị « localhost:25 » mặc định. Còn nếu có máy khác có thể sẽ gửi thông điệp SMTP cho máy này, hãy thêm vào đây địa chỉ của giao diện mạng của bạn, v.d. « localhost:25;192.168.1.2:25 ».

source: Of course you can also replace the '25' with another port number, however this is unusual.
vi: Tất nhiên, bạn cũng có khả năng thay thế số « 25 » bằng số hiệu cổng khác, nhưng thường không phải.

source: Use syslogd for logs?
vi: Dùng syslogd cho bản ghi không?

source: You can decide whether masqmail should log via syslog or not. If not, logs will be written to /var/log/masqmail/masqmail.log.
vi: Bạn có dịp chọn nếu masqmail nên ghi lưu thông qua phần mềm ghi lưu hệ thống syslog hay không. Nếu không thì các bản ghi sẽ được ghi vào « /var/log/masqmail/masqmail.log ».

source: file
vi: tập tin

source: pipe
vi: ống dẫn

source: Online detection method:
vi: Phương pháp phát hiện trực tuyến:

source: Masqmail has different methods to determine whether it is online or not, these are 'file','pipe'.
vi: Masqmail có hai phương pháp khác để phát hiện nếu nó trực tuyến hay không: « tập tin » và « ống dẫn ».

source: For 'file', masqmail checks for the existence of a file, and, if it exists, reads from it the name of the connection.
vi: Đối với « tập tin », masqmail kiểm tra có tập tin chưa, và nếu có, đọc từ nó tên của sự kết nối.

source: For 'pipe', masqmail calls a program or script, which outputs the name if online or nothing if not. You can use eg. the program guessnet for this.
vi: Còn đối với « ống dẫn », masqmail gọi chương trình hay văn lệnh mà xuất tên nếu trực tuyến, không hoặc gì nếu không phải. Chương trình có khả năng này gồm guessnet và whereami.

source: File used to determine the online status:
vi: Tập tin dùng để quyết định trạng thái trực tuyến:

source: Name of the program used to determine the online status:
vi: Tên của chương trình dùng để quyết định trạng thái trực tuyến:

source: Please choose the program to use to determine the online status. Please note that, when this program is called, masqmail has the user id 'mail'.
vi: Hãy chọn chương trình cần dùng để quyết định trạng thái trực tuyến. Ghi chú rằng khi chương trình này được gọi, masqmail có mã nhận diện người dùng là « mail » (thư tín).

source: Local delivery style:
vi: Cách phát cục bộ :

source: Local mail can be delivered to a mailbox, to an MDA (eg. procmail) or to a qmail style Maildir in the users home dir.
vi: Các thư cục bộ có thể được phát cho hộp thư, cho MDA (v.d. procmail) hoặc cho maildir kiểu qmail nằm trong thư mục gốc của người dùng.

source: You can select the default style here. You can configure this also on a per-user basis with the options mbox_users, mda_users and maildir_users.
vi: Ở đây bạn có thể chọn cách mặc định. Cũng có thể cấu hình nó đặc trưng cho người dùng, bằng tùy chọn « mbox_users », « mda_users » và « maildir_users ».

source: MDA command line (including options):
vi: Dòng lệnh MDA (gồm các tùy chọn):

source: Please choose the path to the mail delivery agent (MDA), including its arguments. You can use substitution values here, eg. ${rcpt_local} for the user name.
vi: Hãy chọn đường dẫn đến tác nhân phát thư (MDA), gồm các đối số. Có thể thay thế giá trị, v.d. « ${rcpt_local} » cho tên người dùng.

source: For other substitutions please see the man page.
vi: Đối với giá trị thay thế khác, xem trang hướng dẫn (dùng lệnh « man masqmail »).

source: This question is also asked if you did not set mbox_default to mda, since you can use mda for a set of users specially.
vi: Câu này cũng được hỏi nếu bạn đã không đặt « mbox_default » (hộp thư mặc định) thành « mda », vì bạn có khả năng sử dụng mda cho một tập người dùng riêng.

source: Alias expansion regarding case or not:
vi: Mở rộng bí danh phân biệt chữ hoa/thường không?

source: Masqmail uses the file /etc/aliases to redirect local addresses. The search for a match in /etc/aliases can be regarding upper/lower case or insensitive to case.
vi: Masqmail dùng tập tin « /etc/aliases » để chuyển tiếp địa chỉ cục bộ. Việc tìm kiếm qua tập tin này có thể phân biệt chữ hoa/thường hay không.

source: Start SMTP listening daemon?
vi: Khởi chạy trình nền lắng nghe SMTP không?

source: Please choose whether you want masqmail to start as an SMTP listening daemon. You will need this if: - there are other hosts in your local network that may want to send mail via this host - you use a mail client that sends mail via SMTP (netscape, mozilla are examples)
vi: Hãy chọn nếu bạn muốn masqmail khởi chạy như là trình nền lắng nghe SMTP hay không. Thiết lập này cần thiết nếu : • có máy khác cũng nằm trên mạng cục bộ mà có thể sẽ gửi thư thông qua máy này • bạn dùng ứng dụng khách thư mà gửi thư thông qua SMTP (v.d. netscape, mozilla).

source: Start SMTP queue running daemon?
vi: Khởi chạy trình nền chạy hàng đợi SMTP không?

source: Please choose this option if you want masqmail to start as a queue running daemon. You're very likely to need this. It is used for mail that cannot delivered immediately, either because of delivery failures or because you were not online on the first attempt to send a mail.
vi: Hãy bật tùy chọn này nếu bạn muốn masqmail khởi chạy như là trình nền chạy hàng đợi. Thiết lập này khuyến khích để quản lý các thư chưa phát được, hoặc vì việc phát bị lỗi hoặc vì bạn không phải trực tuyến khi mới gửi thư đó.

source: Interval for the queue running daemon:
vi: Khoảng cho trình nền chạy hàng đợi:

source: Please choose the interval for the queue running daemon. -q10m means flush the queue every 10 minutes.
vi: Hãy chọn thời gian giữa hai lần xóa sạch hàng đợi. « -q10m » có nghĩa là trình nền chạy hàng đợi sẽ thao tác mọi thư nằm trong hàng đợi vào mỗi mười phút.

source: The format is -q, followed by an numeric value and one of the letters s,m,h,d,w for seconds, minutes, hours, days or weeks respectively.
vi: Cú pháp là « -q », con số và một của những chữ : • s giây • m phút • h giờ • d ngày • w tuần.

source: Reasonable values are between 5 minutes (-q5m) and 2 hours (-q2h).
vi: Giá trị thường nằm trong phạm vị 5 phút (-q5m) đến 2 giờ (-q2h).

source: Start POP3 fetch daemon?
vi: Khởi chạy trình nền fetch POP3 không?

source: Please choose this option if you want masqmail to start as a fetch daemon. If you do so, masqmail will try to fetch mail from POP3 servers that you configure in regular intervals, detecting the online status first.
vi: Hãy bật tùy chọn này nếu bạn muốn masqmail khởi chạy như là trình nền fetch. Nếu có, masqmail sẽ thử định kỳ lấy các thư từ máy phục vụ POP mà bạn cấu hình, trước tiên phát hiện trạng thái trực tuyến.

source: No matter what you choose here, you can later select whether you want to fetch mail the moment you get online.
vi: Bất chấp bạn chọn gì ở đây, lúc sau bạn vẫn còn có khả năng chọn lấy thư hay không khi mới trực tuyến.

source: Interval for the fetch daemon:
vi: Khoảng cho trình nền fetch:

source: Please choose the interval for the fetch daemon.
vi: Hãy chọn thời gian giữa hai lần lấy thư cho trình nền fetch.

source: The format is -go, followed by an numeric value and one of the letters s,m,h,d,w for seconds, minutes, hours, days or weeks respectively.
vi: Cú pháp là « -go », con số và một của những chữ : • s giây • m phút • h giờ • d ngày • w tuần.

source: Reasonable values are between 2 minutes (-go2m) and 2 hours (-go2h).
vi: Giá trị thường nằm trong phạm vị 2 phút (-go2m) và 2 giờ (-go2h).

source: Flush mail queue when you get online?
vi: Xoá sạch hàng đợi thư một khi trực tuyến không?

source: Please choose whether you want masqmail to immediately flush its mail queue as soon as you go online. This will be done in the ip-up script in /etc/ppp/ip-up or in /etc/network/if-up.d/.
vi: Hãy chọn nếu bạn muốn masqmail quản lý các thư còn nằm trong hàng đợi thư một khi bạn trực tuyến. Lệnh này được thực hiện khi chạy văn lệnh ip-up (trong « /etc/ppp/ip-up » hay « /etc/network/if-up.d/ »).

source: Fetch mail when you get online?
vi: Lấy thư một khi trực tuyến không?

source: Please choose whether you want masqmail to immediately fetch mail from POP3 servers as soon as you go online. This will be done in the ip-up script in /etc/ppp/ip-up or in /etc/network/if-up.d/.
vi: Hãy chọn nếu bạn muốn masqmail lấy thư từ máy phục vụ POP3 một khi bạn trực tuyến. Lệnh này được thực hiện khi chạy văn lệnh ip-up (trong « /etc/ppp/ip-up » hay « /etc/network/if-up.d/ »).

source: List of interfaces used for masqmail online detection:
vi: Danh sách giao diện dùng để masqmail phát hiện trực tuyến:

source: Please choose a list of network interfaces which will trigger queue runs and/or fetching mails when going up. The list will be used in the /etc/ppp/ip-up and /etc/network/if-up.d/ scripts, when the interface goes up.
vi: Hãy chọn một danh sách các giao diện mạng sẽ gây ra việc chạy hàng đợi và/hay lấy thư một khi hoạt động. Danh sách này sẽ được dùng trong những văn lệnh « /etc/ppp/ip-up » và « /etc/network/if-up.d/ ».

source: A reasonable choice is eg. 'ppp0' for a desktop at home, or 'ppp0 eth0' for a notebook.
vi: Giá trị thường là « ppp0 » cho máy tính cá nhân ở nhà, hoặc « ppp0 eth0 » cho máy tính xách tay.

source: Set to 'all' for all interfaces, or 'none' for no interfaces.
vi: Đặt thành « all » (tất cả) để bật mọi giao diện, hoặc « none » (không có) để tắt mọi giao diện.
